app/controllers/api/v1/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY name asc
SELECT  `posts`.* FROM `posts` ORDER BY name asc LIMIT 2 OFFSET 0
---
  def index
    @posts = Post.order("name asc")
    @page_posts = @posts.paginate(:page => params[:page],:per_page => 2)
     render json: {
       posts: @posts,
       page_posts: @page_posts,
       per_page: @page_posts.per_page,
      page: @page_posts.current_page,
      pages: @posts.length

INSERT INTO `posts` (`name`, `title`, `author`, `description`, `published_at`, `created_at`, `updated_at`, `category_id`) VALUES ('freterte', 'vbvsdfsdf', 'qdqdqeq', 'xcvxcvxc', '2019-03-25', '2019-03-25 07:55:20', '2019-03-25 07:55:20', 2)
---
  def create
    post = Post.new(post_params)
      if post.save

UPDATE `posts` SET `title` = 'Ruby Essential 1', `author` = 'David Pudson', `description` = 'Ruby Essential 1', `category_id` = 1, `last_edited_at` = '2019-03-25', `updated_at` = '2019-03-25 13:34:43' WHERE `posts`.`id` = 19
---
  def update
      if @post.update(post_params)

DELETE FROM `posts` WHERE `posts`.`id` = 13
---
  def destroy
    @post.destroy

SELECT `posts`.* FROM `posts` WHERE (name LIKE '%Java 8%')
---
  def search
    query = params[:query]
    posts = Post.where('name LIKE ?',
                       "%#{query}%")