app/controllers/posts_controller.rb

  def index
    @posts = Post.order("name asc")
    @page_posts = @posts.paginate(:page => params[:page],:per_page => 2)
---
SELECT `posts`.* FROM `posts` ORDER BY name asc
SELECT COUNT(*) FROM `posts`
SELECT  `posts`.* FROM `posts` ORDER BY name asc LIMIT 2 OFFSET 0

  def create
    post = Post.new(post_params)
      if post.save
---
INSERT INTO `posts` (`name`, `title`, `author`, `description`, `published_at`, `created_at`, `updated_at`, `category_id`) VALUES ('Python', 'Python', 'Michael', 'Python Programming', '2019-03-22', '2019-03-22 10:02:13', '2019-03-22 10:02:13', 2)

  def update
      if @post.update(post_params)
---
UPDATE `posts` SET `name` = 'Bootstrap 4', `title` = 'Bootstrap 4', `author` = 'Bootstrap 4', `description` = 'Bootstrap 4', `updated_at` = '2019-03-25 00:26:12' WHERE `posts`.`id` = 11

  def destroy
    @post.destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 13

  def search
    puts "**************************"
    puts params[:query].inspect
    query = params[:query]
    posts = Post.where('name LIKE ?',
                       "%#{query}%")
---
SELECT `posts`.* FROM `posts` WHERE (name LIKE '%Java 8%')

  def set_post
      @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1